``` sql
CREATE TABLE customers(
	customer_id SERIAL PRIMARY KEY,
	customer_name VARCHAR(50),
	city VARCHAR(50)
);

CREATE TABLE orders(
	order_id SERIAL PRIMARY KEY,
	customer_id SERIAL REFERENCES customers(customer_id),
	order_date DATE,
	total_amount DECIMAL
);

INSERT INTO customers(customer_name, city)
VALUES
	('John Doe', 'New York'),
	('Jane Smith', 'Los Angeles'),
	('David Johnson', 'Chicago');

INSERT INTO orders(customer_id, order_date, total_amount)
VALUES
	(1, '2022-01-10', 100.00),
	(1, '2022-02-15', 150.00),
	(2, '2022-03-20', 200.00),
	(3, '2022-04-25', 50.00);

SELECT 
	customer_name,
	COUNT(o.customer_id) AS total_orders
FROM customers AS c
LEFT JOIN orders AS o
	ON c.customer_id = o.customer_id
GROUP BY c.customer_name;
```